In [1]:
import seaborn as sns
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
df.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [6]:
# 데이터 불균형 해결 -> 22회 부터 새로운 패키지 설치 가능
#!conda install -c conda-forge imbalanced-learn -y

In [7]:
# KNN 기반의 SMOTE 
from imblearn.over_sampling import SMOTE

In [8]:
# SMOTE 시 Null값이 있으면 안되므로 삭제
df.dropna(inplace = True)

In [10]:
X = df[['age','sibsp','parch','fare']]
y = df.survived

In [11]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.3,stratify = y, shuffle = True, random_state = 1)

In [12]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler(feature_range = (0,1))
X_train = scaler.fit_transform(X_train)

In [13]:
X_train.shape

(127, 4)

In [14]:
y_train.value_counts()

1    86
0    41
Name: survived, dtype: int64

In [15]:
# 모델 설정
sm = SMOTE( k_neighbors = 5)

# train데이터를 넣어 복제함
X_resampled , y_resampled = sm.fit_resample(X_train, y_train)

print('After OverSampling, the shape of train_X: {}'.format(X_resampled.shape))
print('After OverSampling, the shape of train_y: {}'.format(y_resampled.shape))

print('After OverSampling, the counts of label "1": {}'.format(sum(y_resampled == 1)))
print('After OverSampling, the counts of label "0": {}'.format(sum(y_resampled == 0)))

After OverSampling, the shape of train_X: (172, 4)
After OverSampling, the shape of train_y: (172,)
After OverSampling, the counts of label "1": 86
After OverSampling, the counts of label "0": 86